//
//  CarLog.h
//  CrazyCar
//
//  Created by Edward on 16/3/1.
//  Copyright © 2016年 Edward. All rights reserved.
//

#ifndef CarLog_h
#define CarLog_h

/*********CrazyCar项目日志**********/

/**
 -------2016.2.26-------
 
 1、数据包抓取
 2、整理抓取API，制作文档
 
 -------2016.2.29-------
 
 1、引入三方库
 2、定制cell搭建选车界面以及头条界面
 
 -------2016.3.1--------
 
 1、解决昨天界面bug（创建的xib和类名不一致，导致崩溃）
 2、实现头条中的普通cell点击界面
 
 -------2016.3.2--------
 
 1、实现选车具体到某一款的页面
 2、添加该页面的收藏功能，建立数据库工具
 3、目前会出现收藏时，数据库的表建立成功，但里面没数据，并且会出现崩溃
 
 
 -------2016.3.3--------
 
 1、视频页面实现、播放还未实现
 
 
 -------2016.3.4--------
 
 1、用webView加载MP4链接实现视频的播放
 2、将热门新闻原有的tableView放到一个scrollView中
 
 
 -------2016.3.5--------
 
 1、在热门新闻页面中在添加两个tableViews实现三个tableViews的滑动
 2、在热门新闻的navigationbar上添加一个view，并实现与scrollViews的连动
 
 -------2016.3.6--------
 
 1、处理热门新闻上下滑动关联不一致的bug，但之后视觉效果差了些
 
 -------2016.3.7--------
 
 1、修复收藏功能bug，之前会在三方库中崩溃，原因可能由于主键seristId的类型保存出错
 2、发现视频页面的“视频专区”中没有MP4链接，原App是通过流媒体请求优酷网进行播放
 
 -------2016.3.8--------
 
 1、完成个人页面
 
 -------2016.3.9---------
 
 1、视频播放器仍有些bug，会出现未加载成功退出时会发生闪退并且播放视频时内存占用比较大
 2、换掉WMPlayer，改用KRVideo
 
 --------2016.3.10--------
 
 1、测试项目，修复bug。以及部分未适配好屏幕的UI
 
 --------2016.3.11-------
 
 1、测试
 
 --------2016.3.12-------
 
 1、测试
 
 */
#endif /* CarLog_h */
